{
    "global": {
        "nav_home": "Home",
        "nav_tools": "Tools",
        "nav_games": "Games",
        "nav_blog": "Blog",
        "lang_en": "English",
        "lang_ko": "Korean",
        "footer_terms": "Terms of Service",
        "footer_privacy": "Privacy Policy",
        "footer_licenses": "Licenses",
        "footer_copyright": "© 2025 ctrlcat. All rights reserved.",
        "list_search_tools_placeholder": "Search tools...",
        "list_search_games_placeholder": "Search games...",
        "list_all_tags": "All",
        "list_error": "Error loading list. Please try again later.",
        "list_expand": "▼",
        "list_collapse": "▲",
        "home_title": "Home",
        "tools_title": "Tools",
        "games_title": "Games",
        "blog_title": "Blog",
        "licenses_title": "Licenses",
        "privacy_title": "Privacy Policy",
        "terms_title": "Terms of Service",
        "home_meta_description": "A collection of free, easy-to-use online tools and fun games. Convert units, generate QR codes, play classic games, and more.",
        "home_hero_title": "Your Ultimate Collection of Free Online Tools & Games",
        "home_hero_subtitle": "Solve daily problems, boost productivity, and enjoy a moment of fun.",
        "home_search_placeholder": "Search for tools and games...",
        "home_featured_tools_title": "Featured Tools",
        "home_blog_title": "From the Blog",
        "home_view_all_posts": "View all posts",
        "home_all_tools_title": "All Tools",
        "home_all_tools_intro": "Boost your productivity with our suite of free online utilities. From converting color codes to generating QR codes, we have the tools to simplify your daily tasks.",
        "home_view_all_tools": "View all tools",
        "home_all_games_title": "All Games",
        "home_all_games_intro": "Need a break? Challenge yourself with our collection of classic and addictive web-based games.",
        "home_view_all_games": "View all games"
    },
    "pages": {
        "licenses": {
            "title": "Licenses",
            "intro": "This project utilizes the following open-source software. We are grateful to the developers for their contributions.",
            "items": [
                {
                    "name": "Marked.js",
                    "license": "MIT License",
                    "description": "A markdown parser and compiler. Used for rendering description files.",
                    "url": "https://github.com/markedjs/marked/blob/master/LICENSE.md"
                },
                {
                    "name": "Font Awesome",
                    "license": "Font Awesome Free License (SIL OFL 1.1 for Fonts, MIT for Code)",
                    "description": "The iconic font and CSS toolkit. Used for icons throughout the site.",
                    "url": "https://fontawesome.com/license/free"
                },
                {
                    "name": "qrcode-generator",
                    "license": "MIT License",
                    "description": "A QR code generator library. Used in the QR Code Generator tool.",
                    "url": "https://github.com/kazuhikoarase/qrcode-generator/blob/master/LICENSE"
                },
                {
                    "name": "Firebase",
                    "license": "Apache License 2.0",
                    "description": "A platform developed by Google for creating mobile and web applications. Used for the Secret Box tool.",
                    "url": "https://www.apache.org/licenses/LICENSE-2.0"
                }
            ]
        },
        "privacy": {
            "title": "Privacy Policy",
            "last_updated": "November 3, 2025",
            "sections": [
                {
                    "title": "1. Information We Collect",
                    "content": [
                        "We collect and process information in the following ways, depending on the services you use:",
                        {
                            "type": "list",
                            "items": [
                                "<strong>Client-Side Tools:</strong> A majority of our tools operate entirely within your web browser (\"client-side\"). For these tools, any data you input is processed on your own device and is <strong>never sent to, stored on, or seen by our servers</strong>.",
                                "<strong>Server-Side Tools:</strong> For certain tools that require data to be saved for later retrieval, we may store the information you voluntarily provide on third-party cloud infrastructure (such as Google Firebase). This is only done to provide the core functionality of the tool.",
                                "<strong>Locally Stored Data:</strong> For some games, we may store data such as your high score directly on your device using your browser's `localStorage` feature. This data is not transmitted to our servers.",
                                "<strong>Analytics Data:</strong> We may use third-party services like Google Analytics to collect anonymous data about how you use our website (e.g., pages visited, time spent). This data helps us understand user behavior and improve the service."
                            ]
                        }
                    ]
                },
                {
                    "title": "2. How We Use Information",
                    "content": [
                        "We use the information we collect solely to:",
                        {
                            "type": "list",
                            "items": [
                                "Provide, maintain, and improve our services.",
                                "Understand and analyze how you use our services."
                            ]
                        }
                    ]
                },
                {
                    "title": "3. Data Storage and Security",
                    "content": "Data for our server-side tools is stored using third-party cloud services like Google Firebase. We rely on their robust security measures to protect this data. While we strive to use commercially acceptable means to protect your information, we cannot guarantee its absolute security as no method of transmission over the Internet is 100% secure."
                },
                {
                    "title": "4. Third-Party Services",
                    "content": "Our service may contain links to other sites and uses third-party services (like Google Firebase for data storage and potentially Google Analytics for usage analysis). We are not responsible for the privacy practices of these other services and encourage you to read their privacy policies."
                },
                {
                    "title": "5. Changes to This Policy",
                    "content": "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page. You are advised to review this Privacy Policy periodically for any changes."
                }
            ]
        },
        "terms": {
            "title": "Terms of Service",
            "last_updated": "November 3, 2025",
            "sections": [
                {
                    "title": "1. Acceptance of Terms",
                    "content": "By accessing and using this website, you accept and agree to be bound by the terms and provision of this agreement. If you do not agree to abide by the above, please do not use this service."
                },
                {
                    "title": "2. User-Generated Content and Data",
                    "content": [
                        "You are solely responsible for the content you create, upload, or process using our tools. This applies to any data processed entirely in your browser (\"Client-Side Tools\") and any data you voluntarily submit for storage on our servers (\"Server-Side Tools\"). You agree not to use the service to create, store, or transmit any content that is illegal, infringes on copyright, is defamatory, or is otherwise malicious.",
                        "We do not claim ownership of your content. For certain games, data such as high scores may be saved locally in your browser's storage for your convenience. This data is stored only on your device and is not transmitted to us."
                    ]
                },
                {
                    "title": "3. Prohibited Conduct",
                    "content": "You agree not to use the service for any illegal or unauthorized purpose. You agree to comply with all laws, rules, and regulations applicable to your use of the service."
                },
                {
                    "title": "4. Disclaimers and Limitation of Liability",
                    "content": "This service is provided \"as is\" without any warranties of any kind. We do not guarantee that the service will be error-free or uninterrupted. In no event shall we be liable for any damages whatsoever arising out of the use of or inability to use the service."
                },
                {
                    "title": "5. Changes to Terms",
                    "content": "We reserve the right to modify these terms at any time. We will notify you of any changes by posting the new Terms of Service on this page. Your continued use of the service after any such changes constitutes your acceptance of the new terms."
                }
            ]
        }
    },
    "2048": {
        "name": "2048",
        "description": "An addictive puzzle game where you combine tiles with arrow keys to create the 2048 tile.",
        "content": {
            "score": "SCORE",
            "best": "BEST",
            "new_game": "New Game",
            "retry": "Retry",
            "game_over": "Game Over!"
        },
        "desc": {
            "title": "### Key Features",
            "feature1": "- **Keyboard & Swipe Controls**: Move tiles with arrow keys (↑, ↓, ←, →) on PC or by swiping on mobile.",
            "feature2": "- **Merging Tiles**: When two tiles with the same number meet, they merge into a new tile with the combined value.",
            "feature3": "- **Scoring System**: Your score increases with every merge. Creating higher-numbered tiles earns more points.",
            "feature4": "- **Game Over**: The game ends when you can no longer move or merge any tiles.",
            "how_to_title": "### How to Play",
            "step1": "1. When the game starts, two tiles (usually the number 2) will appear randomly on the 4x4 grid.",
            "step2": "2. Use your keyboard's arrow keys or swipe on the screen to slide all tiles in your desired direction.",
            "step3": "3. After a move, if two tiles with the same number are adjacent, they will merge into one. (e.g., 4 and 4 combine to become 8).",
            "step4": "4. With every move, a new tile (either a 2 or a 4) will appear in an empty spot.",
            "step5": "5. The main goal is to create the **2048** tile. Of course, you can continue playing after that to achieve an even higher score."
        }
    },
    "gomoku": {
        "name": "Gomoku",
        "description": "A classic board game where you win by placing five stones in a row first.",
        "content": {
            "black_turn": "Black's Turn",
            "white_turn": "White's Turn",
            "black_wins": "Black Wins!",
            "white_wins": "White Wins!",
            "draw": "Draw!",
            "retry": "Retry"
        },
        "desc": {
            "title": "### Key Features",
            "feature1": "- **15x15 Board**: Played on a standard 15x15 grid, the official size for Gomoku.",
            "feature2": "- **Intuitive Play**: Simply click with a mouse on PC or touch the screen on mobile to place your stone.",
            "feature3": "- **Win/Draw Detection**: The game ends when one player gets five stones in a row or when the board is full.",
            "how_to_title": "### How to Play (Standard Rules)",
            "step1": "1. The first player uses black stones, and the second player uses white stones.",
            "step2": "2. On your turn, click (or touch) an empty intersection to place your stone.",
            "step3": "3. The first person to get five of their stones in a row—horizontally, vertically, or diagonally—wins.",
            "step4": "4. If the board is filled before a winner is decided, the game is a draw.",
            "note": "**Note**: The current version uses standard rules and does not apply 'Renju rules' (e.g., no forbidden moves like three-and-three or overlines)."
        }
    },
    "tic-tac-toe": {
        "name": "Tic-Tac-Toe",
        "description": "A classic game where two players take turns placing O's and X's to make a line.",
        "content": {
            "x_turn": "X's Turn",
            "o_turn": "O's Turn",
            "x_wins": "X Wins!",
            "o_wins": "O Wins!",
            "draw": "Draw!",
            "retry": "Retry"
        },
        "desc": {
            "title": "### Key Features",
            "feature1": "- **2-Player Game**: A two-player game you can enjoy with a friend or colleague.",
            "feature2": "- **Simple Rules**: Easy-to-learn rules make it perfect for a quick, casual game.",
            "feature3": "- **Win Indication**: When a player wins, a line is drawn through the winning row to visually confirm the victory.",
            "feature4": "- **Play Again**: Once the game is over, you can instantly start a new one with the 'Retry' button.",
            "how_to_title": "### How to Play",
            "step1": "1. The first player uses 'X', and the second player uses 'O'.",
            "step2": "2. On your turn, click (or touch) one of the empty squares in the 3x3 grid to place your mark.",
            "step3": "3. You win by getting three of your marks in a row—horizontally, vertically, or diagonally.",
            "step4": "4. If all 9 squares are filled and no one has three in a row, the game is a draw."
        }
    },
    "color-code-converter": {
        "name": "Color Code Converter",
        "description": "Quickly convert between HEX, RGB, and HSL codes for collaboration between designers and developers.",
        "content": {
            "title": "Color Value",
            "hex": "HEX",
            "rgb": "RGB",
            "hsl": "HSL"
        },
        "desc": {
            "title": "### Key Features",
            "feature1": "- **Real-time Color Conversion**: Conversions between HEX, RGB, and HSL formats happen instantly.",
            "feature2": "- **Visual Color Confirmation**: The converted color can be immediately seen in the preview area at the top.",
            "feature3": "- **Support for Various Formats**: Supports all three major color representation methods essential for web design and development.",
            "tip_title": "### Usage Tips",
            "tip1": "- **Copying Values**: Easily copy the value from any format's input field and paste it directly into your CSS or design tool.",
            "tip2": "- **Exploring Colors**: You can easily find the desired shade by adjusting the Lightness or Saturation values in the HSL format.",
            "tip3": "- **RGB Input Format**: RGB values must be entered with each number separated by a comma, like `255, 100, 0`."
        }
    },
    "image-format-converter": {
        "name": "Image Format Converter",
        "description": "Convert various image formats like JPG, PNG, WebP as needed.",
        "content": {
            "select_image_title": "1. Select Image",
            "find_file": "Find File",
            "no_file_selected": "No file selected",
            "select_format_title": "2. Select format to convert",
            "format_jpg": "JPG",
            "format_png": "PNG",
            "format_webp": "WebP",
            "format_bmp": "BMP",
            "format_gif": "GIF (first frame only)",
            "convert": "Convert",
            "preview": "Preview",
            "image_preview": "Image Preview",
            "download": "Download",
            "notice": "Note: For GIF format, only the first frame of the animation is converted. Browser support for some formats (e.g., BMP) may vary.",
            "alert_select_file": "Please select an image file first.",
            "download_converted_image": "Download converted image ({format})"
        },
        "desc": {
            "title": "### Key Features",
            "feature1": "- **Multiple Format Support**: Supports seamless conversion between major web image formats like JPG, PNG, WebP, and BMP.",
            "feature2": "- **Local Processing**: All conversion processes are done entirely within your browser. No images are sent to a server, ensuring your privacy and data security.",
            "feature3": "- **Real-time Preview**: Once you select an image, you can immediately check it in the preview.",
            "tip_title": "### Usage Tips",
            "tip1": "- **WebP Conversion**: Improve your website's loading speed by converting images to the WebP format, which significantly reduces file size while maintaining quality.",
            "tip2": "- **Maintaining Transparency**: To preserve transparency in images with clear backgrounds, you must convert them to PNG format. Converting to JPG will fill the transparent areas with white.",
            "tip3": "- **GIF Conversion**: The current version only converts the first frame of an animated GIF. This can be useful when you want to save a single frame as a static image."
        }
    },
    "qr-code-generator": {
        "name": "QR Code Generator",
        "description": "Instantly convert a URL or text into a QR code for marketing or information sharing.",
        "content": {
            "placeholder": "Enter text or URL to convert to QR code...",
            "submit": "Generate QR Code",
            "default_text": "QR code will be displayed here.",
            "alert_enter_text": "Please enter text or a URL.",
            "error_loading_library": "Error loading QR code library.",
            "error_creating_qr": "Error generating QR code: {error}"
        },
        "desc": {
            "title": "### Key Features",
            "feature1": "- **Instant Generation**: Enter text or a website address (URL) and press the button to generate a QR code instantly.",
            "feature2": "- **High Compatibility**: The generated QR codes are reliably recognized by most smartphone cameras and QR code scanning apps.",
            "feature3": "- **Versatile Use**: Share any information you want—personal websites, Wi-Fi access details, event page links, contact information, and more—by embedding it in a QR code.",
            "tip_title": "### Usage Tips",
            "tip1": "- **URL Shortening**: Very long URLs can make the QR code complex. Using a URL shortening service like `bit.ly` can create a simpler, more reliable QR code.",
            "tip2": "- **Saving the Image**: You can save the generated QR code as a file by right-clicking on it and selecting 'Save image as...'. On mobile, long-press the image to see the save option.",
            "tip3": "- **Offline Sharing**: Print the saved QR code image and insert it into posters, business cards, or flyers to easily share information offline."
        }
    },
    "secret-box": {
        "name": "Secret Box",
        "description": "A secret box to share data anonymously with people around the world.",
        "content": {
            "info": "This is a space where anyone in the world can leave data and a 'secret key', and view other people's data.",
            "data_placeholder": "Enter data here...",
            "key_placeholder": "Decryption password (secret key)",
            "save": "Save",
            "view_all": "View all data",
            "alert_enter_all": "Please enter both data and secret key.",
            "alert_saved": "Data saved successfully!",
            "error_saving": "Error saving data: ",
            "alert_save_failed": "Failed to save data. Check the console.",
            "loading": "Loading...",
            "no_data": "No secret data saved yet.",
            "error_loading": "Error loading data: ",
            "alert_load_failed": "Failed to load data."
        },
        "desc": {
            "title": "### Key Features",
            "feature1": "- **Anonymous Messaging**: Anyone can post messages anonymously to share with users worldwide.",
            "feature2": "- **Real-time Updates**: You can view messages left by other users in real-time by clicking the 'View all data' button.",
            "feature3": "- **Firebase Integration**: Experience how data is stored and shared through integration with Firestore, Google's powerful real-time database.",
            "tip_title": "### Usage Tips",
            "tip1": "- **Refreshing**: Click the 'View all data' button again to refresh the list to its latest state.",
            "tip2": "- **Meaning of the Secret Key**: In the current version, the 'secret key' is not used for encrypting messages but simply as a simple value to identify the data. Be careful not to enter important passwords.",
            "warning_title": "⚠️ Warning",
            "warning_text": "This tool is for educational and experimental purposes only. Never enter sensitive or important personal information, financial details, etc. All data is public and can be viewed by anyone."
        }
    },
    "unit-converter": {
        "name": "Unit Converter",
        "description": "Inter-convert all measurement units for daily and professional fields such as length, weight, volume, and temperature.",
        "content": {
            "category_label": "Conversion Type",
            "from_label": "From",
            "to_label": "To",
            "categories": {
                "length": "Length",
                "weight": "Weight",
                "temperature": "Temperature",
                "volume": "Volume"
            },
            "units": {
                "meter": "meter (m)",
                "kilometer": "kilometer (km)",
                "centimeter": "centimeter (cm)",
                "millimeter": "millimeter (mm)",
                "mile": "mile (mi)",
                "yard": "yard (yd)",
                "foot": "foot (ft)",
                "inch": "inch (in)",
                "gram": "gram (g)",
                "kilogram": "kilogram (kg)",
                "milligram": "milligram (mg)",
                "ton": "ton (t)",
                "pound": "pound (lb)",
                "ounce": "ounce (oz)",
                "celsius": "Celsius (°C)",
                "fahrenheit": "Fahrenheit (°F)",
                "kelvin": "Kelvin (K)",
                "liter": "liter (L)",
                "milliliter": "milliliter (mL)",
                "cubic_meter": "cubic meter (m³)",
                "gallon": "gallon (gal)",
                "fluid_ounce": "fluid ounce (fl oz)"
            }
        },
        "desc": {
            "title": "### Key Features",
            "feature1": "- **Various Categories**: Supports conversion for key units closely related to daily life, such as length, weight, temperature, and volume.",
            "feature2": "- **Real-time Conversion**: Results are calculated and displayed instantly as you enter values or change units.",
            "feature3": "- **Intuitive Interface**: Provides a simple user experience where you just select the conversion type, enter a value, and choose the units.",
            "tip_title": "### Usage Tips",
            "tip1": "- **Reverse Conversion**: You can easily check the reverse conversion result by swapping the 'From' and 'To' units.",
            "tip2": "- **Temperature Conversion**: Minor discrepancies may occur in the decimal places for conversions between Celsius (°C), Fahrenheit (°F), and Kelvin (K). This is a natural result of the definitions of each unit.",
            "tip3": "- **Default Value**: The page loads with a default value of `1`, allowing you to quickly see how each unit converts based on a standard of `1`."
        }
    },
    "ascii-unicode-converter": {
        "name": "ASCII/Unicode Converter",
        "description": "Converts between characters and ASCII/Unicode code values.",
        "content": {
            "char_input_label": "Character",
            "char_input_placeholder": "Enter characters...",
            "to_code_btn": "▼ Character to Code",
            "code_output_label": "Code",
            "code_output_placeholder": "Code result (comma-separated) - e.g., 72,101,108,108,111",
            "to_char_btn": "▲ Code to Character",
            "error_message": "Error: {error}",
            "error_nan": "Contains non-numeric values."
        },
        "desc": {
            "title": "### Key Features",
            "feature1": "- **Character ↔ Code Conversion**: You can convert entered letters or symbols into Unicode numerical values, or vice versa.",
            "feature2": "- **Encoding Problem Solving**: When text appears broken during web development, it helps diagnose the problem by checking the exact code value of the character.",
            "tip_title": "### Usage Tips",
            "tip1": "- **Simultaneous Conversion of Multiple Characters**: You can get a comma-separated list of the code values for each character by entering multiple characters at once.",
            "tip2": "- **Entering Code Values**: When entering code values to convert to characters, each number must be separated by a comma (,), like `72, 101, 108, 108, 111`.",
            "tip3": "- **Checking Emojis**: You can also convert emojis like 💻, ✨ into code values."
        }
    },
    "test": {
        "name": "test",
        "description": "A brief description of test.",
        "content": {
            "title": "Welcome to test!"
        },
        "desc": {
            "title": "### About test",
            "main": "More detailed information about this item."
        }
    }
}