{
    "global": {
        "nav_home": "Home",
        "nav_tools": "Tools",
        "nav_games": "Games",
        "nav_blog": "Blog",
        "lang_en": "English",
        "lang_ko": "Korean",
        "footer_terms": "Terms of Service",
        "footer_privacy": "Privacy Policy",
        "footer_licenses": "Licenses",
        "footer_copyright": "© 2025 ctrlcat. All rights reserved.",
        "list_search_tools_placeholder": "Search tools...",
        "list_search_games_placeholder": "Search games...",
        "list_all_tags": "All",
        "list_error": "Error loading list. Please try again later.",
        "list_expand": "▼",
        "list_collapse": "▲",
        "home_title": "Home",
        "tools_title": "Tools",
        "games_title": "Games",
        "blog_title": "Blog",
        "licenses_title": "Licenses",
        "privacy_title": "Privacy Policy",
        "terms_title": "Terms of Service",
        "home_meta_description": "A collection of free, easy-to-use online tools and fun games. Convert units, generate QR codes, play classic games, and more.",
        "home_hero_title": "Your Ultimate Collection of Free Online Tools & Games",
        "home_hero_subtitle": "Solve daily problems, boost productivity, and enjoy a moment of fun.",
        "home_search_placeholder": "Search for tools and games...",
        "home_featured_tools_title": "Featured Tools",
        "home_blog_title": "From the Blog",
        "home_view_all_posts": "View all posts",
        "home_all_tools_title": "All Tools",
        "home_all_tools_intro": "Boost your productivity with our suite of free online utilities. From converting color codes to generating QR codes, we have the tools to simplify your daily tasks.",
        "home_view_all_tools": "View all tools",
        "home_all_games_title": "All Games",
        "home_all_games_intro": "Need a break? Challenge yourself with our collection of classic and addictive web-based games.",
        "home_view_all_games": "View all games"
    },
    "blog_categories": {
        "guides": "Guides"
    },
    "pages": {
        "licenses": {
            "title": "Licenses",
            "intro": "This project utilizes the following open-source software. We are grateful to the developers for their contributions.",
            "items": [
                {
                    "name": "Marked.js",
                    "license": "MIT License",
                    "description": "A markdown parser and compiler. Used for rendering description files.",
                    "url": "https://github.com/markedjs/marked/blob/master/LICENSE.md"
                },
                {
                    "name": "Font Awesome",
                    "license": "Font Awesome Free License (SIL OFL 1.1 for Fonts, MIT for Code)",
                    "description": "The iconic font and CSS toolkit. Used for icons throughout the site.",
                    "url": "https://fontawesome.com/license/free"
                },
                {
                    "name": "qrcode-generator",
                    "license": "MIT License",
                    "description": "A QR code generator library. Used in the QR Code Generator tool.",
                    "url": "https://github.com/kazuhikoarase/qrcode-generator/blob/master/LICENSE"
                },
                {
                    "name": "Firebase",
                    "license": "Apache License 2.0",
                    "description": "A platform developed by Google for creating mobile and web applications. Used for the Secret Box tool.",
                    "url": "https://www.apache.org/licenses/LICENSE-2.0"
                }
            ]
        },
        "privacy": {
            "title": "Privacy Policy",
            "last_updated": "November 3, 2025",
            "sections": [
                {
                    "title": "1. Information We Collect",
                    "content": [
                        "We collect and process information in the following ways, depending on the services you use:",
                        {
                            "type": "list",
                            "items": [
                                "<strong>Client-Side Tools:</strong> A majority of our tools operate entirely within your web browser (\"client-side\"). For these tools, any data you input is processed on your own device and is <strong>never sent to, stored on, or seen by our servers</strong>.",
                                "<strong>Server-Side Tools:</strong> For certain tools that require data to be saved for later retrieval, we may store the information you voluntarily provide on third-party cloud infrastructure (such as Google Firebase). This is only done to provide the core functionality of the tool.",
                                "<strong>Locally Stored Data:</strong> For some games, we may store data such as your high score directly on your device using your browser's `localStorage` feature. This data is not transmitted to our servers.",
                                "<strong>Analytics Data:</strong> We may use third-party services like Google Analytics to collect anonymous data about how you use our website (e.g., pages visited, time spent). This data helps us understand user behavior and improve the service."
                            ]
                        }
                    ]
                },
                {
                    "title": "2. How We Use Information",
                    "content": [
                        "We use the information we collect solely to:",
                        {
                            "type": "list",
                            "items": [
                                "Provide, maintain, and improve our services.",
                                "Understand and analyze how you use our services."
                            ]
                        }
                    ]
                },
                {
                    "title": "3. Data Storage and Security",
                    "content": "Data for our server-side tools is stored using third-party cloud services like Google Firebase. We rely on their robust security measures to protect this data. While we strive to use commercially acceptable means to protect your information, we cannot guarantee its absolute security as no method of transmission over the Internet is 100% secure."
                },
                {
                    "title": "4. Third-Party Services",
                    "content": "Our service may contain links to other sites and uses third-party services (like Google Firebase for data storage and potentially Google Analytics for usage analysis). We are not responsible for the privacy practices of these other services and encourage you to read their privacy policies."
                },
                {
                    "title": "5. Changes to This Policy",
                    "content": "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page. You are advised to review this Privacy Policy periodically for any changes."
                }
            ]
        },
        "terms": {
            "title": "Terms of Service",
            "last_updated": "November 3, 2025",
            "sections": [
                {
                    "title": "1. Acceptance of Terms",
                    "content": "By accessing and using this website, you accept and agree to be bound by the terms and provision of this agreement. If you do not agree to abide by the above, please do not use this service."
                },
                {
                    "title": "2. User-Generated Content and Data",
                    "content": [
                        "You are solely responsible for the content you create, upload, or process using our tools. This applies to any data processed entirely in your browser (\"Client-Side Tools\") and any data you voluntarily submit for storage on our servers (\"Server-Side Tools\"). You agree not to use the service to create, store, or transmit any content that is illegal, infringes on copyright, is defamatory, or is otherwise malicious.",
                        "We do not claim ownership of your content. For certain games, data such as high scores may be saved locally in your browser's storage for your convenience. This data is stored only on your device and is not transmitted to us."
                    ]
                },
                {
                    "title": "3. Prohibited Conduct",
                    "content": "You agree not to use the service for any illegal or unauthorized purpose. You agree to comply with all laws, rules, and regulations applicable to your use of the service."
                },
                {
                    "title": "4. Disclaimers and Limitation of Liability",
                    "content": "This service is provided \"as is\" without any warranties of any kind. We do not guarantee that the service will be error-free or uninterrupted. In no event shall we be liable for any damages whatsoever arising out of the use of or inability to use the service."
                },
                {
                    "title": "5. Changes to Terms",
                    "content": "We reserve the right to modify these terms at any time. We will notify you of any changes by posting the new Terms of Service on this page. Your continued use of the service after any such changes constitutes your acceptance of the new terms."
                }
            ]
        }
    }
}